app/views/messages/_side_bar.html.haml

SELECT `groups`.* FROM `groups` INNER JOIN `group_users` ON `groups`.`id` = `group_users`.`group_id` WHERE `group_users`.`user_id` = 1
---
  .sidebar__group--list
    - current_user.groups.each do |group|
      .sidebar__group--list__top-items