app/controllers/groups_controller.rb

INSERT INTO `group_users` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (2, 1, '2020-08-19 10:13:03.130879', '2020-08-19 10:13:03.130879')
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('jikkenn', '2020-08-19 10:13:03.127445', '2020-08-19 10:13:03.127445')
---
  def new
    @group = Group.new
    @group.users << current_user

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
UPDATE `groups` SET `groups`.`name` = 'グループ１改', `groups`.`updated_at` = '2020-08-19 10:49:02.743741' WHERE `groups`.`id` = 1
---
  def update
    @group = Group.find(params[:id])
    if @group.update(group_params)