app/controllers/messages_controller.rb

SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1
---
  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)

INSERT INTO `messages` (`body`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'Railsの処理の流れ_0409.png', 3, 1, '2020-08-24 00:19:43.438513', '2020-08-24 00:19:43.438513')
SELECT `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 8)
---
  def create
    @message = @group.messages.new(message_params)
    if @message.save
      redirect_to group_messages_path(@group), notice: 'メッセージが送信されました'
    else
      @messages = @group.messages.includes(:user)